In [26]:
import pandas as pd
weather_data = {
    'day': ['1/1/2017','1/2/2017','1/3/2017','1/4/2017','1/5/2017','1/6/2017'],
    'temperature': [32,35,28,24,32,31],
    'windspeed': [6,7,2,7,4,2],
    'event': ['Rain', 'Sunny', 'Snow','Snow','Rain', 'Sunny']
}
df = pd.DataFrame(weather_data)
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [7]:
df.shape

(6, 4)

In [8]:
 rows, columns = df.shape

In [9]:
rows

6

In [10]:
columns

4

In [12]:
df.head()

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain

In [13]:
df.head(2)

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny

In [14]:
df.tail(1)

        day  temperature  windspeed  event
5  1/6/2017           31          2  Sunny

In [15]:
df[2:5]

        day  temperature  windspeed event
2  1/3/2017           28          2  Snow
3  1/4/2017           24          7  Snow
4  1/5/2017           32          4  Rain

In [16]:
df.columns

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

In [17]:
df.day

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: day, dtype: object

In [18]:
df[['day', 'event']]

        day  event
0  1/1/2017   Rain
1  1/2/2017  Sunny
2  1/3/2017   Snow
3  1/4/2017   Snow
4  1/5/2017   Rain
5  1/6/2017  Sunny

In [19]:
df.temperature.max()

35

In [20]:
df.describe()

       temperature  windspeed
count     6.000000   6.000000
mean     30.333333   4.666667
std       3.829708   2.338090
min      24.000000   2.000000
25%      28.750000   2.500000
50%      31.500000   5.000000
75%      32.000000   6.750000
max      35.000000   7.000000

In [22]:
df.day[df.temperature==df.temperature.max()]

1    1/2/2017
Name: day, dtype: object

In [23]:
winter_data = {
    'day': ['1/1/2017','1/2/2017','1/3/2017','1/4/2017','1/5/2017','1/6/2017'],
    'temperature': [32,35,28,24,32,31],
    'windspeed': [6,7,2,7,4,2],
    'event': ['Rain', 'Sunny', 'Snow','Snow','Rain', 'Sunny']
}

In [27]:
dt = pd.DataFrame(winter_data)
dt

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [28]:
dt

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [29]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [32]:
df3=df.join(dt, lsuffix="_left", rsuffix="_right")

In [33]:
df3

,day_left,temperature_left,windspeed_left,event_left,day_right,temperature_right,windspeed_right,event_right
0,1/1/2017,32,6,Rain,1/1/2017,32,6,Rain
1,1/2/2017,35,7,Sunny,1/2/2017,35,7,Sunny
2,1/3/2017,28,2,Snow,1/3/2017,28,2,Snow
3,1/4/2017,24,7,Snow,1/4/2017,24,7,Snow
4,1/5/2017,32,4,Rain,1/5/2017,32,4,Rain
5,1/6/2017,31,2,Sunny,1/6/2017,31,2,Sunny

In [34]:
pd.merge(dt, df, on='day')

,day,temperature_x,windspeed_x,event_x,temperature_y,windspeed_y,event_y
0,1/1/2017,32,6,Rain,32,6,Rain
1,1/2/2017,35,7,Sunny,35,7,Sunny
2,1/3/2017,28,2,Snow,28,2,Snow
3,1/4/2017,24,7,Snow,24,7,Snow
4,1/5/2017,32,4,Rain,32,4,Rain
5,1/6/2017,31,2,Sunny,31,2,Sunny